[
  {
    "uid": "0",
    "cateName": "Magic",
    "isSelect": true,
    "items": [
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/opengraph/MTG-The-Last-Ride-DFT.png",
        "headline": "The Best Vehicles in MTG",
        "sub_headline": "The best Vehicles in MTG let you put a bunch of goblins into a car and then drive that car into your opponent. It's truly a unique experience in Magic: The Gathering, and while the card type was once very limited, we've now had a handful of sets that have added more and more options for those of us who want to run Vehicles in different formats.\n There's definitely more of a Commander focus with a lot of Vehicles, but there are a few that ascend beyond that into the more traditional ways of playing MTG. Either way, we're going to talk about what cards you'll want to keep an eye out for and think about building around in whatever format these vehicles are legal in.",
        "sections": [
          {
            "title": " What are Vehicles in MTG?",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614159_in_600x600.jpg",
            "extra": "Market Price: $0.08",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614164_in_600x600.jpg",
            "extra": "Market Price: $0.02",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614155_in_600x600.jpg",
            "extra": "Market Price: $0.02",
            "content": "Vehicles are a kind of artifact that are sometimes creatures and sometimes not. The way that each one works is that they have a crew number on them, like Crew 1, and that means you have to tap any number of creatures with a total power equal to that number, and then the Vehicle will stop being just an artifact and become an artifact creature instead. You can use a crewed Vehicle to attack, block, and activate effects where applicable. Crewing a Vehicle is a special action which means this is an action that doesn't use the stack. These happen immediately, and they can't be responded to by the opponent."
          },
          {
            "title": "Best Vehicles in MTG",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/616050_in_600x600.jpg",
            "extra": "Market Price: $0.02",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/615415_in_600x600.jpg",
            "extra": "Market Price: $0.04",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/615231_in_600x600.jpg",
            "extra": "Market Price: $0.49",
            "content": "Vehicles can offer a really exciting line of play to any deck. A lot of them are colorless, meaning you could theoretically play them in just about any deck. We've made this list based on the Vehicles with a mix of power and ubiquity. That's all of the ado, let's have no more ado and get into the actual list."
          },
          {
            "title": "#9 Shorikai, Genesis Engine",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/618002_in_800x800.jpg",
            "extra": "Secret Lair Drop Series, mythic",
            "content": "Shorikai, Genesis Engine is a four-mana white and blue 8/8 with Crew 8. You can pay one mana and tap it to draw two cards, discard a card, and then create a 1/1 Pilot token. This Pilot token can crew Vehicles as though it had a power of two, which has its uses, and this card can be your Commander. It's a generally very strong Vehicle support card, and even just drawing cards is good enough with everything else it does."
          },
          {
            "title": "#8 Skysovereign, Consul Flagship",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/615749_in_800x800.jpg",
            "extra": "Special Guests, mythic",
            "content": "Skysovereign, Consul Flagship is a five-mana 6/5 with flying and Crew 3. When it enters the battlefield or attacks, you can deal three damage to any creature or Planeswalker. This basically puts Lightning Bolt onto an artifact that'll not only be relevant the turn you play it but potentially help you wipe out threats from then on, too."
          },
          {
            "title": "#7 Parhelion II",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/263077_in_800x800.jpg",
            "extra": "Commander: Kamigawa: Neon Dynasty, rare",
            "content": "Parhelion II is an eight-mana white 5/5 with flying, first strike, vigilance, and Crew 4. Whenever it attacks, you create two 4/4 angel tokens that not only have flying and vigilance but also come in attacking at the opponent. While it's undoubtedly an expensive card to play, it's also one that effectively attacks with a whopping thirteen power every time it does so, which is amazing. Also, Parhellion II is best played with Greasefang, Okiba Boss, who is an excellent Vehicle-focused Commander."
          },
          {
            "title": "#6 The Indomitable",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/526205_in_800x800.jpg",
            "extra": "Commander: The Lost Caverns of Ixalan, rare",
            "content": "The Indomitable is a four-mana blue 6/6 with trample and Crew 3. It lets you draw a card whenever a creature you control deals combat damage to a player. That's basically always a good effect, but you can also cast it from your graveyard as long as you control three or more tapped pirates and/or vehicles. It's strong and resilient, drawing you a ton of cards."
          },
          {
            "title": "#5 Esika's Chariot",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/230173_in_800x800.jpg",
            "extra": "Kaldheim, rare",
            "content": "Esika's Chariot is the first of two Cat-themed chariots on the list, which is either a strange coincidence, or it's just Wizards of the Coast knowing its audience. This four-mana green 4/4 with Crew 4 creates two 2/2 Cat tokens as it enters. When it attacks, you create a copy of a token you control. This can be a powerhouse in a lot of Commander decks, and even at its worst, it gets you two cats! Who doesn't love that?"
          },
          {
            "title": "#4 Cryptcaller Chariot",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614165_in_800x800.jpg",
            "extra": "Aetherdrift, rare",
            "content": "Cryptcaller Chariot is a four-mana black 5/5 with menace and Crew 2. This beast of a chariot, also pulled by cats, creates a 2/2 Zombie token whenever you discard cards equal to the number of cards discarded. We're not sure you even need to crew this one for it to be absurdly strong, especially with the new Eternal Might Commander Precon."
          },
          {
            "title": "#3 Salvation Engine",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/615774_in_800x800.jpg",
            "extra": "Aetherdrift, mythic",
            "content": "Salvation Engine is a five-mana white 6/10 with Crew 6. It's hard to Crew, but good lord, the toughness on this thing is absurd. Also, Salvation Engine grants all other artifact creatures you control +2/+2, which is excellent and allows you to return an artifact from your graveyard to the battlefield when it attacks. It does a lot of work whether it's a creature or not, so it's very strong and acts as a Sun Titan for artifact decks."
          },
          {
            "title": "#2 Smuggler's Copter",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/263086_in_800x800.jpg",
            "extra": "Commander: Kamigawa: Neon Dynasty, rare",
            "content": "Smuggler's Copter is a two-mana 3/3 wth flying and Crew 1. When it attacks or blocks, you can draw a card and then discard acard. Despite looking unassuming, this card was banned (and has since been unbanned) in formats such as Pioneer, because it's aggressive while churning value though card draw."
          },
          {
            "title": "#1 The Last Ride",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614207_in_800x800.jpg",
            "extra": "Aetherdrift, mythic",
            "content": "The Last Ride is a one-mana black 13/13 with Crew 2. It gets -X/-X, where X is your life total, and allows you to pay three mana and two life to draw a card. The Last Ride is obviously reminiscent of Death's Shadow, which is already strong, but the additional utility of it allowing you to draw cards and manipulate your own life total could potentially make it even stronger."
          }
        ]
      },
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/opengraph/MTG-Zur-Eternal-Schemer-DMU.png",
        "headline": "MTG Standard Power Rankings After Pro Tour: Aetherdrift",
        "sub_headline": "Welcome to the Standard Power Rankings. The new Aetherdrift expansion put its wheels to the pavement this month, and over the weekend the best players in the world met in Chicago, Illinois for the largest Pro Tour since 2019!\nIt's always fun to see what happens when a fun format and a new set are thrown into the competitive crucible. We saw some big new innovation, as well as old favorites performing well. So let's go over the list of what I expect to be the best Standard decks in the immediate wake of the Pro Tour.",
        "sections": [
          {
            "title": "The Best Decks in Standard",
            "image": "",
            "extra": "",
            "content": "For each archetype on the list, I've included the decklist of its highest-finishing pilot at Pro Tour Aetherdrift. I'll also reference some win rate stats compiled by Frank Karsten from the Swiss rounds of the event."
          },
          {
            "title": "#15 Golgari Graveyard",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/525117_in_600x600.jpg",
            "extra": "Market Price: $307.91",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614155_in_600x600.jpg",
            "extra": "Market Price: $0.02",
            "content": "Vehicles are a kind of artifact that are sometimes creatures and sometimes not. The way that each one works is that they have a crew number on them, like Crew 1, and that means you have to tap any number of creatures with a total power equal to that number, and then the Vehicle will stop being just an artifact and become an artifact creature instead. You can use a crewed Vehicle to attack, block, and activate effects where applicable. Crewing a Vehicle is a special action which means this is an action that doesn't use the stack. These happen immediately, and they can't be responded to by the opponent."
          },
          {
            "title": "Best Vehicles in MTG",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/616050_in_600x600.jpg",
            "extra": "Market Price: $0.02",
            "content": "Golgari Graveyard is an innovative brew that a small handful of players brought to the Pro Tour, and which Zevin Faust used to reach the Top 8. Much like the older Simic Terror decks, this is a self-mill strategy that fills its graveyard in order to get a discount on big spells and repeatedly trigger Up the Beanstalk."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/513095_in_600x600.jpg",
            "extra": "Market Price: $2.67",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/578886_in_600x600.jpg",
            "extra": "Market Price: $36.54",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/544712_in_600x600.jpg",
            "extra": "Market Price: $0.11",
            "content": "The main difference is that while Simic Terror wants to fill the graveyard with instants and sorceries, the Golgari Graveyard deck is effectively all creatures, and uses payoffs like Hollow Marauder and Huskburster Swarm. This deck is adept at flooding the board with oversized creatures, allowing it to easily overpower aggro and midrange decks.\nWinning 51.6 percent of your matches and putting a player in the Top 8 is a huge accomplishment for a homebrew deck. Golgari Graveyard looks like a ton of fun, and I'm eager to see if it can stand the test of time."
          },
          {
            "title": "#14 Omniscience",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/513300_in_600x600.jpg",
            "extra": "By Sean Goddard",
            "content": "With a 56.7 percent win rate, Azorius Omniscience was one of the winningest decks of the event, even though none of its pilots happened to spike a high finish. While the Omniscience combo isn't exactly brand new, I don't think many of us were expecting it to be a major competitor at the PT - particularly in this highly-tuned and much-improved form."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/557923_in_600x600.jpg",
            "extra": "Market Price: $5.11",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/526193_in_600x600.jpg",
            "extra": "Market Price: $0.17",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/490546_in_600x600.jpg",
            "extra": "Market Price: $0.35",
            "content": "The goal is to mill Omniscience and use Abuelo's Awakening to return it to the battlefield. If everything goes well, you can then enact a loop with Invasion of Arcavios and win the game. Even if the opponent points a removal spell at the 1/1 Omniscience token, the density of instant-speed plays leaves the combo player with a good chance of taking over the game anyway. This makes for a very scary and difficult-to-disrupt combo deck.\nIf slower decks like Domain gain ground after the Pro Tour, then Azorius Omniscience could be a metagame call to punish them."
          },
          {
            "title": "#13 Selesnya/Bant Midrange",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/557921_in_600x600.jpg",
            "extra": "By Abe Schnake",
            "content": "Selesnya Midrange (also known as Selesnya Cage or Selesnya Gearhulk) really became possible with Foundations and the reprinting of Llanowar Elves. Alongside hard-hitting threats and creatures that generate multiple bodies, it plays with the powerful payoff card Collector's Cage. Overlord of the Mistmoors is perfect with both plans, since you can use the impending cost to build out your board, or drop the hammer when you're fortunate enough to find the seven-drop via hideaway."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/545127_in_600x600.jpg",
            "extra": "Market Price: $7.95",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/575052_in_600x600.jpg",
            "extra": "Market Price: $10.46",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/596628_in_600x600.jpg",
            "extra": "Market Price: $17.77",
            "content": "Selesnya Cage placed 10th at the Pro Tour with the big new addition of Brightglass Gearhulk. The best performing variant - a Bant version splashing for Mockingbird and sideboard permission spells - won 60 percent of its matches (though it's useful to note that some other variants performed poorly). I believe this archetype is still being improved upon and still working on making its mark on the format.\nIf you want my personal opinion, I think this deck is awesome, and I suspect will probably earn a higher ranking sooner or later. Collector's Cage is a borderline broken card that's finally found the right home. If it wasn't for a tricky Domain matchup giving me pause, this is a deck that I could easily see myself picking up."
          },
          {
            "title": "#12 Temur Otters",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614435_in_600x600.jpg",
            "extra": "Market Price:  $169.14",
            "content": "Temur Otters wasn't the best deck at 2024 Worlds or at Pro Tour Aetherdrift, nor was it a big winner from either of the recent set releases. Still, it's a good deck and has been kept alive by a very small crowd of dedicated players. Rei Zhang reached the Top 8 at the Magic Spotlight event in Atlanta, and Jacob Bartollini - the soul Otters player at the Pro Tour - went 8-2.\nThis is a combo deck that generates and untaps creatures to fuel the mana engine of Enduring Vitality. In many games, this deck will play out as a midrange value deck. However, it can also assemble an infinite loop by bouncing Stormchaser's Talent and Up the Beanstalk with This Town Ain't Big Enough and then leveling Talent to pick up This Town Ain't Big Enough and repeat the process. Along the way, you can draw as many cards as you like, and trigger prowess enough times to easily kill the opponent."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/578080_in_600x600.jpg",
            "extra": "Market Price: $5.77",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/559146_in_600x600.jpg",
            "extra": "Market Price: $2.77",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/559757_in_600x600.jpg",
            "extra": "Market Price: $11.60",
            "content": "Just like Azorius Omniscience, Otters can serve as a way to prey on Domain and slower midrange decks."
          },
          {
            "title": "#11 Mono-White Midrange",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/575047_in_600x600.jpg",
            "extra": "Market Price: $176.27",
            "content": "White-based midrange decks have waxed and waned in popularity over the last few months, and I would say it's at a relative low point right now. It wasn't successful at the Pro Tour and stands to struggle in a world where Domain is popular.\nStill, it's important to respect Mono-White as a real player in Standard that has long-term results and a tried-and-true pedigree. Mono-White is strong against other midrange decks, and has many great tools against red aggro. Among these anti-creature measures are Lay Down Arms, Sunfall and Beza, the Bounding Spring."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/559638_in_600x600.jpg",
            "extra": "Market Price: $13.93",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/575047_in_600x600.jpg",
            "extra": "Market Price: $5.62",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/559627_in_600x600.jpg",
            "extra": "Market Price: $4.21",
            "content": "Enduring Innocence can sort of represent extra copies of the deck's key card (Caretaker's Talent), and give Mono-White more ways to bury the opponent in card advantage.\n I'm a big fan of Demolition Field right now, as several decks on the Rankings (namely Esper Pixie, Jeskai Oculus and Jeskai Convoke) typically play only one basic land."
          }
        ]
      },
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/magic/2025/02/22/MTG-Avatar-The-Last-Airbender-1.png",
        "headline": "Avatar: The Last Airbender Comes to MTG, a New Mox Appears in Tarkir: Dragonstorm, and More Announced at MagicCon: Chicago",
        "sub_headline": "You thought we were good for Magic news for a while with the First Look of Magic: The Gathering—FINAL FANTASY earlier this week? Wrong, as Wizards of the Coast shared a slew of information about the upcoming releases in Tarkir: Dragonstorm, Edge of Eternities, and Magic: The Gathering | Avatar the Last Airbender during the Preview Panel at MagicCon: Chicago. \nThere's tons of information and tidbits to get through as it lays the release schedule for the rest of the year, so let's wrap up everything that was revealed (and announced) at MagicCon: Chicago on Friday.",
        "sections": [
          {
            "title": " Dragons? Dragons.",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/619637_in_600x600.jpg",
            "extra": "Market Price: $9.95",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/619633_in_600x600.jpg",
            "extra": "Market Price: n/a",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/619640_in_600x600.jpg",
            "extra": "Market Price: n/a",
            "content": "Kicking off the Preview Panel at MagicCon: Chicago was the First Look of Tarkir: Dragonstorm, which is the next Standard release after Aethedrift. Dropping April 11, 2025, Tarkir: Dragonstorm takes us back to Tarkir, where the five Clans (Temur, Mardu, Abzan, Jeskai, and Sultai) return after overthrowing the Dragonlords and rediscover their roots. There's also Dragons, a lot of Dragons."
          },
          {
            "title": "Mox Jasper",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/619643_in_800x800.jpg",
            "extra": "Legendary Artifact",
            "content": "One of the high-profile cards revealed from Tarkir: Dragonstorm is Mox Jasper, which joins the iconic class of Mox cards, with this one tapping for any color of mana if you control a Dragon card. Mox Jasper is going to be a staple in a mixture of Dragon Commander builds, especially those led by The Ur-Dragon and Miirym, Sentinel Wyrm, as it fixes your colors to cast those (sometimes, mana-demanding) Dragon spells. That wasn't all, as it was confirmed Mox Jasper is also the Headliner card for Tarkir: Dragonstorm, where you can open a serialized Retro Frame copy in only Collector Boosters. These will be the big ticket items in Tarkir: Dragonstorm where many budding Dragon Commander players will want to own this card from release day and beyond."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/619641_in_600x600.jpg",
            "extra": "Market Price: n/a",
            "content": "Perhaps the most exciting reveal from Takir: Dragonstorm is Skirmish Rhino, which is a nod to Khans of Tarkir's Siege Rhino, who was once the bane of Standard. While Skirmish Rhino is likely going to be an all-star in Limited play, it's doubtful the card will be any good in Standard. But, a nod is a nod. \nThe reveal of Skirmish Rhino also shows off the unique Ghostfire Showcase Frame that can also appear in Halo Foil (in Tarkir: Dragonstorm Collector Boosters only), a treatment first introduced in March of the Machine's Multiverse Legends. "
          },
          {
            "title": "",
            "image": "https://mktg-assets.tcgplayer.com/content/magic/2025/02/22/tarkir-dragonstorm-product%20range.png",
            "extra": "",
            "content": "Wizards of the Coast also revealed the complete product lineup for Takir: Dragonstorm, which includes a whopping five Commander Precons and five different Prerelease Kits, one of each of the Clans on Tarkir. The Commander Precons are:\nJeskai Strike (blue/red/white)\n Mardu Surge (red/white/black)\nSultai Arisen (black/green/blue)\nTemur Roar (green/blue/red)\nAbzan Armor (white/black/green)\nIt's clear Tarkir: Dragonstorm will be a massive set, where each of the Commander Precons will feature a Spirit Dragon from the respected clan, with Teval, the Balanced Scale confirmed for the Sultai Arisen Commander Precon. Previews begin for Tarkir: Dragonstorm on March 18 and conclude on May 28, with theTarkir: Dragonstorm Gallery being completed by then."
          },
          {
            "title": "Magic: The Gathering Goes to Space with Edge of Eternities",
            "image": "https://mktg-assets.tcgplayer.com/content/opengraph/MTG-Tezzeret-EOE-CROPPED.png",
            "extra": "",
            "content": "Releasing August 1, 2025, Edge of Eternities takes Magic: The Gathering to space as Wizards of the Coast revealed the product line and some key art to support the Standard release. Much like Aetherdrift, Edge of Eternities seems to be a smaller in scale as it offers only two Commander Precons (Counter Intelligence (blue/red/white) and World Shaper (black/red/green)) with the usual line of Play and Collector Boosters along with Bundles to collect on release day and beyond. Edge of Eternities sees the return of Tezzeret, as the set takes place on the edge of the Blind Eternities which is brimmed with creatures and worlds never seen before by players. Oh, and the Kavu are back."
          },
          {
            "title": "Avatar: The Last Airbender Comes to Magic: The Gathering",
            "image": "",
            "extra": "c",
            "content": "And capping off the impressive slate of reveals at MagicCon: Chicago is the announcement of the third (and final) Universes Beyond release of 2025 - Avatar: The Last Airbender. Releasing on November 21, 2025, Magic: The Gathering | Avatar the Last Airbender will be a Standard release and will capture the journey of Aang, Katara, Sokka, and Toph as they look to tackle the Fire Nation before Lord Ozai attempts to conquer the world. \nIf you follow Magic: The Gathering deeply, the announcement of Magic: The Gathering | Avatar the Last Airbender may not come as much of a surprise as the MTG Arena team teased the collaboration with Nickelodeon Animation Studio. Back in January, you could buy card aesthetics in MTG Arena with the word bender in the card name, which also featured the four elements (fire, water, air, and earth) that are a common theme in Avatar: The Last Airbender. It's unclear if we'll see any The Legend of Korra cards as part of Magic: The Gathering | Avatar the Last Airbender, but either way, players are excited to master the elements upon the November release."
          }
        ]
      }
    ]
  },
  {
    "uid": "1",
    "cateName": "Pokemon",
    "isSelect": false,
    "items": [
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/pokemon/_2025/FEB/27/PKMN-Pok%C3%A9mon-Day-2025-News-Opengraph.jpg",
        "headline": "The Biggest News from Poke Day 2025",
        "sub_headline": "We have officially entered the most wonderful Thursday of 2025—it's Poke Day!\nFor those unaware, the wider Poke community gathers together on February 27th each year to celebrate the original release of Poke Red and Poke Green in Japan. Believe it or not, that was twenty-nine years ago now. I am older than Poke by a matter of weeks, and that's a terrifying thought.\nWhile this year's announcements were on the lighter side, there was plenty to get excited about, and not everybody gets the pleasure of spending their work day staring at a Poke broadcast—so I've got you covered. Let's break down all the biggest announcements, exciting moments, and sneaky freebies to be found across Poke Day this year!",
        "sections": [
          {
            "title": "New Video Game Announced: Pk Champions",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/FEB/27/Pokemon%20Champions.jpg",
            "extra": "",
            "content": "Pk Champions is designed to focus on the Pk battles we know and love from core Pokémon games as opposed to anything particularly story-driven. It aims to be high-octane action 100% of the time to better appeal to a wider audience.\n Given that a wider audience is the goal, it's unsurprising to see such a heavy focus on cross-compatibility for Pokémon Champions. The game will be arriving on both Nintendo Switch and mobile devices, but also connects cleanly to Pokémon Home. That's a huge deal—you'll be able to play with your favorite Pokémon from Pokémon Go, Pokémon Scarlet, or Pokémon Violet in all your battles to come!\nThere is no current release date for Pokémon Champions, so you'll need to stay tuned if you'd like to find out more."
          },
          {
            "title": "Pokémon Legends Z-A to Release in Late 2025",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/FEB/27/legends%20ZA.jpg",
            "content": "Up next, we received a hefty update about the future of Pokémon Legends Z-A. This title was teased toward the end of Pokémon Day 2024, and fans across the world have been clamoring for more information ever since. The good news? It looks incredible. The bad news? It won't be arriving until late 2025.\n A detailed trailer walked us through the brand-new version of Lumiose City, the largest city in the Kalos region. Lumiose is undergoing a high-tech urban redevelopment plan to transform it into a city that people and Pokémon can truly share.\n As is tradition, you'll have three pseudo-starters to choose from as you begin your sightseeing journey: Chikorita, Tepig, or Totodile. There's a wide variety of characters introduced throughout the trailer that will form the majority of your journey throughout the game, and dedicated Wild Zones throughout the city where you'll find all the Pokémon you're hoping to catch!\nThe biggest selling point for Pokémon Legends Z-A is no doubt a brand-new style of Pokémon battles never before explored. Moves are designed to have longer or shorter reach or different areas of effect, so choosing your timing and positioning in this 3D world is going to be more important than ever before. Certain Pokémon will also be capable of going beyond Evolution into Mega Evolution, offering new levels of power than can turn the tide of a battle in your favor.\nLate 2025 seems a million miles away, but I'm certainly more excited to get my hands on Pokémon Legends Z-A than I was before. Great stuff!"
          },
          {
            "title": "New Content Coming to Existing Pokémon Games",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/FEB/27/Pokemon%20Go%20Unova%20Tour.jpg",
            "content": "Pokémon Go will be offering a free global event featuring the Legendary Pokémon Black Kyurem and White Kyurem as raid bosses, alongside Victini and Shiny Meloetta as available encounters. There's sure to be some promo codes thrown out as a new season of play begins, so be sure to log in if that appeals."
          },
          {
            "title": "",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/FEB/27/Pokemon%20Unite.jpg",
            "content": "Pokémon Unite will also add three brand-new Pokémon to its roster: Suicune, Alolan Raichu, and Alcremie. The infamous Remoat Arena will also be making a temporary return until March 12th to allow players to celebrate the intense battles of the past once more."
          },
          {
            "title": "",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/FEB/27/new%20Pocket%20set.jpg",
            "content": "Finally, there's a new theme booster for Pokémon TCG Pocket! Triumphant Light looks to be themed entirely around the amazing power of Arceus ex, with the likes of Raichu, Crobat, and Tyranitar making cameo appearance throughout the trailer. This booster pack should be out tomorrow, so get ready to burn some hourglasses!"
          },
          {
            "title": "",
            "image": "",
            "content": "A ranked game mode for Pokémon Pocket is honestly quite surprising to me—but it's not an unwelcome one. A large portion of the community has been enjoying the smooth experience the game offers and had hoped it would extend into a more competitive mode sooner rather than later. Who knows what types of cross-pollination this may lead to in the near future? I may be able to qualify for a World Championship from the comfort of my own toilet!\nIf you're a fan of smaller properties like Pokémon Café ReMix, Pokémon Masters EX, or Pokémon Sleep, there were also a few minor updates and freebies littered throughout the broadcast for your game, so be sure to pop back and grab some goodies."
          }
        ]
      },
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/pokemon/_2025/FEB/19/What-Are-Trainer%27s-Pokemon-Cards-Opengraph.jpg",
        "headline": "What Are Trainer's Pk Cards?",
        "sub_headline": "There's not a soul on earth who hasn't wished for a Pk pet at some point.",
        "sections": [
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/615002_in_600x600.jpg",
            "extra": "Market Price: $354.52",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/615003_in_600x600.jpg",
            "extra": "Market Price: $134.94",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/615004_in_600x600.jpg",
            "extra": "Market Price: $60.86",
            "content": "I mean, think about it. Running late for work? Hop on the back of your Zacian. Phone battery running low? Plug in your Pikachu for a punchy power boost. You could even make s'mores with your Charmander—it'd be adorable!\nWhile I may never get to enjoy a reptile-smoked confectionary, the wider Pokémon universe does understand the importance of a bond between Pokémon and Trainer. There's no Team Rocket without Meowth (well, apart from that time he got fired...) and Cynthia is way less interesting without her lifelong friend, Garchomp. Once we can relate any Pokémon to their owner, they become a much more memorable character and better stories can be told. For goodness sake, I cried when Ash said goodbye to Butterfree! It doesn't get more emotional than that!"
          },
          {
            "title": "Best Vehicles in MTG",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/616050_in_600x600.jpg",
            "extra": "Market Price: $0.02",
            "content": "Golgari Graveyard is an innovative brew that a small handful of players brought to the Pro Tour, and which Zevin Faust used to reach the Top 8. Much like the older Simic Terror decks, this is a self-mill strategy that fills its graveyard in order to get a discount on big spells and repeatedly trigger Up the Beanstalk."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/97061_in_600x600.jpg",
            "extra": "Market Price: $210.28",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/97052_in_600x600.jpg",
            "extra": "Market Price: $251.29",
            "content": "However, we've not seen this bond explored inside the Pokémon TCG for a hot minute. If we ignore reprints like Pokémon Trading Card Game Classic and obscure promos like Ash's Pikachu, we've not seen a trainer officially partner up with their Pokémon since Double Crisis back in 2015.\nA decade later, they're righting that wrong. Trainer's Pokémon are returning in Journey Together, which releases later this year on March 28!"
          },
          {
            "title": "What are Trainer's Pokémon in the Pokémon TCG?",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/FEB/19/Iono%27s-Bellibolt-ex-EN.jpg",
            "content": "Trainer's Pokémon, previously called Owner's Pokémon, are Pokémon cards that carry the name of a Trainer as part of their card name. Each Trainer's Pokémon is considered to be have a different name from other Pokémon of the same species—for example, Iono's Bellibolt ex from the upcoming Journey Together set and Bellibolt ex from Paldea Evolved are considered to have different names for the purposes of deckbuilding. You're allowed to play four copies of each in the same deck if you want to.\nThis comes with some pros and cons. If you take a closer look at Iono's Bellibolt, you'll see that it can only evolve from Iono's Tadbulb: if you want to be invested in a particular Pokémon's story, you'll have to be there from the start. You also couldn't evolve Iono's Tadbulb into a regular old Bellibolt. That isn't how the story goes!\nIn exchange for this extra hoop, you'll get access to some incredible strong and synergistic abilities that you won't be able to find anywhere else. Electric Streamer is a terrifying Ability—but it can only be used on Iono's Pokémon, which really helps to balance it out."
          },
          {
            "title": "How can I tell if I have a Trainer's Pokémon card?",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/83983_in_600x600.jpg",
            "extra": "Market Price: $11.62",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/88874_in_600x600.jpg",
            "extra": "Market Price: $421.79",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/526193_in_600x600.jpg",
            "extra": "Market Price: $101.82",
            "content": "If the name and Trainer-centric artwork weren't enough, there's one additional thing you can look for if you're hoping to spot a Trainer's Pokémon: their corresponding badge. Back when these cards first released in Gym Heroes, the face of the associated trainer would be superimposed on top of their gym badge in the bottom right corner of the card, as we see on Brock's Sandslash. Honestly, I think it looked a little garish, but you can't argue that it works."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614912_in_600x600.jpg",
            "extra": "Market Price: $0.90",
            "content": ""
          },
          {
            "title": "#13 Selesnya/Bant Midrange",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614884_in_600x600.jpg",
            "extra": "Market Price: $0.89",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614926_in_600x600.jpg",
            "extra": "Market Price: $0.75",
            "content": "The upcoming selection of Trainer's Pokémon have polished this up a little. If we take a look at the Japanese counterpart for Journey Together, Battle Partners, we'll find the badge relocated underneath the card artwork like most other event or promotional stamps. This is much more cohesive across multiple cards and steals less of the spotlight from the card artwork itself—I'm loving how Hop looks next to his disgruntled Snorlax!"
          },
          {
            "title": "Which Trainer's Pokémon Appear in Journey Together?",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/FEB/19/Hop%27s%20Dubwool.jpg",
            "extra": "",
            "content": "While the full card list hasn't yet been confirmed, we can again peek at Battle Partners to get a better idea of what to expect once Journey Together makes its grand release. We've also had a few inclusions confirmed by the launch trailer or upcoming product releases by The Pokémon Company International:"
          }
        ]
      },
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/pokemon/_2025/JAN/31/Best-Pokemon-TCG-Pockets-Cards-in-Space-Time-Smackdown-Opengraph.jpg",
        "headline": "The 10 Best Cards In poke TCG Pocket Space-Time Smackdown",
        "sub_headline": "Space-Time Smackdown has made its way to poke TCG Pocket, and the meta is shifting dramatically around some of the newest cards already. Most notably, it's finally opened up some more solid strategies around types that previously didn't get much time on the stage. Not all cards are created equal, however, so let's talk through the best cards you can pull in Space-Time Smackdown (including which of the two packs they're included in!) and how you can use them to crush the competition.",
        "sections": [
          {
            "title": "#10 Weavile ex (Palkia Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Weavile-ex.jpg",
            "extra": "",
            "content": "Weavile ex (and to a lesser extent the base Sneasel), represent the best new option for a fast, aggressive Dark-type deck in Pokémon TCG Pocket. Potentially dealing a very healthy chunk of damage for only one Energy means it can get in, rack up the damage, and then either serve as a solid sacrifice or retreat for an also reasonable one Energy. Not exciting, but a work horse that you'll want."
          },
          {
            "title": "#9 Garchomp (Palkia Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Garcomp.jpg",
            "extra": "",
            "content": "Garchomp is the newest payoff for trying to make Dragon decks work, and alongside a Trainer we're about to see (bet you can guess who), it can do some impressive things. Arguably more important than that Trainer synergy, however, is Garchomp's ability: filtering through your deck while also presenting a late-game threat combines into something stellar without the ex downside."
          },
          {
            "title": "#8 Cynthia (Palkia Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Cynthia.jpg",
            "extra": "",
            "content": "Not surprising those who know their Pokémon, Cynthia does great work alongside her partner Pokémon. While I'm less impressed with Togekiss than I am Garchomp, the overall kit here results in a lot of easy Knock Outs, and that's all while you also get to enjoy the powerhouse plays that Garchomp sets you up for anyway. Cynthia is one of the best cards in Space-Time Smackdown, and well worth building around."
          },
          {
            "title": "#7 Lucario (Dialga Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Lucario.jpg",
            "extra": "",
            "content": "Fighting-type Pokémon didn't really gain all that much with this set, but the one piece they did get in Lucario is excellently positioned. Buffing a number of cards that are already walls is genuinely killer, letting you sit behind cards like Dugtrio and make sure the opposition is just having a real bad time while Lucario is shouting encouragement from the back line."
          },
          {
            "title": "#6 Palkia ex (Palkia Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Palkia-ex.jpg",
            "extra": "",
            "content": "Water-type decks were already not exactly losing out on options, especially with the dedicated cheese of an early Misty potentially setting you up for a win before the opponent can even consider setting up. Palkia ex is another option in the same vein, while chunking your opponent's entire Bench in the process. I still prefer Articuno ex, but there is some logic to trying to make Palkia ex work instead (or in addition to)."
          },
          {
            "title": "#5 Mars (Palkia Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Mars.jpg",
            "extra": "",
            "content": "Pokémon TCG Pocket is drastically missing disruption options, with practically only Red Card seeing any kind of play. Mars will often play similarly to—if not outright better than—Red Card, and decks that just want to disrupt (or grief) the opposition will find a happy home for Mars. I'm not looking forward to losing hands I've spent time sculpting, but that just tells you how good it is."
          },
          {
            "title": "#4 Manaphy (Palkia Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Manaphy.jpg",
            "extra": "",
            "content": "Any kind of Energy generation is something you should strongly consider, so Manaphy ramps its way very high up the list for that alone. A mini-Moltress ex for Water-types is practically ridiculous, and I'm frankly surprised to see any kind of Energy generation in decks that are already being balanced around Misty. That card definitely stifles design, and I'm side-eyeing this from a fun perspective. Doesn't change how this is one of the most powerful cards in Space-Time Smackdown!"
          },
          {
            "title": "#3  Infernape ex (Palkia Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Infernape-ex.jpg",
            "extra": "",
            "content": "Hello Charizard ex, good to see you again. Seriously though, this'll play very similarly to the already-popular finisher for Fire decks in Pokémon TCG Pocket, and Infernape ex has one huge upside that makes up for its slightly lower damage: check out that Retreat Cost! You can't do better than free, and Infernape ex will dance between the Active Spot and getting fed Energy by Moltres ex, being a monkey on the opponent's back for far longer than it has any right to be."
          },
          {
            "title": "#2 Darkrai ex (Dialga Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Darkrai-ex.jpg",
            "extra": "",
            "content": "Darkrai ex jumps near the top of the list of the most powerful cards in Space-Time Smackdown for the same reason we see Weavile ex featured at the beginning. Dark-type decks needed love in Pokémon TCG Pocket, and Darkrai ex gives you the inevitability that something like a Nidoqueen or Weezing sadly lacked. I expect you'll be seeing a lot of Darkrai ex in the future, if for no other reason than because players like me will want to try to make the edgelord Pokémon work."
          },
          {
            "title": "#1 Dialga ex (Dialga Pack)",
            "image": "https://mktg-assets.tcgplayer.com/content/pokemon/_2025/JAN/31/Dialga-ex.jpg",
            "extra": "",
            "content": "No shade on Palkia ex, but Diagla ex is the best card in Space-Time Smackdown.\n Dialga ex is the perfect package, helping you spread energy around the Bench while dealing chip damage, and giving you a perfectly fine 100-damage haymaker. Like Darkrai ex, Dialga ex is the missing piece for Steel decks. Tack on the popularity of this legend and you have another game piece that I'm expecting will be seeing play for a good long while. You love to see this much support for decks that really needed it."
          }
        ]
      }
    ]
  },
  {
    "uid": "2",
    "cateName": "Yu-Gi-Oh",
    "isSelect": false,
    "items": [
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/opengraph/YGO-Speed-Duel-Character-Collage-2.jpg",
        "headline": "Teach Anyone How To Play Yugi",
        "sub_headline": "I've watched a lot of people try to teach Yugi in the last few years, and it almost always goes the same way. See if any of this sounds familiar.",
        "sections": [
          {
            "title": "",
            "image": "",
            "extra": "",
            "content": "The teacher takes out two decks, usually the ones they use in tournaments, while their learner watches eagerly. They begin by explaining the basics: both players start with 8000 Life Points, and the game ends when one player runs out. To win, you summon monsters to battle, and once your opponent has no monsters left, you can attack their life points directly. The learner nods; all of this makes sense. Spell and Trap cards come next. These help summon monsters, win battles, control the field, and destroy the opponent’s cards. More nodding. The teacher unfolds a playmat, places the decks on it, and points out different areas—the graveyard, monster zones, spell and trap zones, and so on. Everything seems to be going smoothly. They move on to the phases of a turn, explaining what happens during each step. The explanation is a little shaky, but it still holds together. Then, they bring out the Extra Deck. This is where things start to get complicated. They introduce a Fusion Monster, explaining that it’s summoned by fusing other monsters. The learner nods. Then comes an Xyz Monster, which is summoned by stacking two monsters on top of each other. The nodding is shakier now. A Synchro Monster follows, requiring a regular monster and a Tuner Monster to be sent to the graveyard. The learner’s eyes start to glaze over. The teacher searches for a Tuner to help illustrate, but the learner’s gaze drifts toward some birds outside. Holding up a card, they point to the word “Tuner” printed on it, trying to regain their student’s focus. The birds tweet. Their song sounds like freedom. Finally, the teacher moves on to Link Monsters, the blue-colored ones that are summoned by\nAnd it's over. Just like that. This poor unfortunate soul who only wanted to learn a children's card game to keep up with their friends is now entirely zoned out, and halfway through the first game they go to the washroom and never come back.\nThe birds fly away. The teacher has never felt so alone.\n Trying to teach someone to play Yu-Gi-Oh with Advanced Format decks is probably the best way to get someone to hate Yu-Gi-Oh. Every time I see this play out, it doesn't even get to what the symbols mean on Continuous cards, or Quick-Plays, or Counter Traps. There are no chains to explain because the first game never lasts long enough for anyone to respond to anything. The Extra Monster Zone sits unused, empty and sad. The entire thing doesn't just fail, it fails like clockwork.\n Look, let's be real: regular Yu-Gi-Oh's too complicated to teach to anyone but the most determined, most hardcore TCG players. And it's ridiculous that people try, because it only takes about 15 minutes to teach someone the game with Speed Duel Starters instead."
          },
          {
            "title": "Bond Between Teacher and Student",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/186904_in_800x800.jpg",
            "extra": "Duel Power, Ultra Rare",
            "content": ""
          },
          {
            "title": "Speed Duel Starters Are Made For Teaching Yu-Gi-Oh",
            "image": "",
            "extra": "",
            "content": "And they're really, really good for it! I grew up a console gamer, but nowadays I spend a lot of time introducing people to card games and board games. So when I saw that we needed an article on how to teach Yu-Gi-Oh, I came into it with a strong instincts to use my regular routine for teaching other games.\nStart by expressing the goal of the game, and add in a hook describing what the game's about to get the learner interested\nGive a basic rundown of the cards, show one to the learner, and take them through it in brief, piece by piece so they know what they're doing when they have a whole hand of them\nList the phases of the turn and loosely describe what each player can do in those phases\nTalk about how wins are normally achieved, and how games normally go, to provide context for all the info you just gave them\nEach of these steps - the intro, a guided look at game elements, the flow of a turn, and added context - apply to most tabletop games, and would normally involve a lot of smaller details and sub-steps. Some people can handle all of that. But for most people, you pick and choose and you focus on the important stuff, as you try to figure out what your learner's retention is like.\n But then I remembered Speed Duel Starters exist, and that while it's not really talked about, they actually have one of the single best introductions to Yu-Gi-Oh ever, in every single box. The Standard Rules For Speed Dueling on the back of each starter playmat are actually an awesome breakdown of Yu-Gi-Oh at its core, and it's really easy to just give them to someone you're teaching and let them check it out. Here's what they look like.\nIf someone's not a gamer, it's best to cut them off and give them a breather once the bullet points run out. You can explain the rest yourself, just following the written guide. But for experienced game fans you can just give them this, and they're going to retain most of it, give or take the individual symbols on cards in that fourth paragraph. There are further rules describing attacking and defending, but honestly, that stuff's intuitive enough that you can describe it to them as you go in your very first game.\n If you want to teach someone Yu-Gi-Oh, your goal isn't to give them all the details they'd need to run off and play competitively. You want them to get a handle on the game and how it works, and you want them to have a good experience that makes them want to come back. Speed Duels cut out a ton of complexity that scares people away from the game, and Speed Duel Starters are, for the most part, an incredibly fast way to get a new player onboarded and confident.\nIf you can introduce the concept of battling monsters duking it out to defend your Life Points and demolish your opponents', then get your friend, family member, or whomever to read the Standard Rules For Speed Dueling, you're officially on your way to having someone new to play Yu-Gi-Oh with and you're moments away from their first games."
          },
          {
            "title": "Mystical Space Typhoon",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/600250_in_800x800.jpg",
            "extra": "Speed Duel: Battle City Finals, Common",
            "content": ""
          },
          {
            "title": "Stuff That Doesn't Matter",
            "image": "",
            "extra": "",
            "content": "In a minute or two we'll talk about some basic prep to make the learning experience a smooth one, and then I'm going to take you through the first five Speed Duel Starter Decks to talk about the ups and downs of each as learning tools. Some of them are awesome for a player's first game. Some of them have major issues, which you'll want to know about in advance. But for now, I want to give a quick list of stuff you DON'T need to teach, at least not until it comes up in your new player's first few games.\n Chains, and responding to effects. Unless they've played games with similar mechanics, chains are tough for new players. We joke about it, but think about it as a total layman with no context outside of how life works: if the Death Star's trying to blow up Endor, and you blow up the Death Star before it can fire, Endor's fine right?\n  … so then how come Mystical Space Typhoon doesn't negate, huh? (Don't @ me. I beg you.)\n A lot of the starters have very few effects that can create chains anyways, so it's not something you need to introduce right off the bat. Play some games first, focus on responding to attacks, then worry about responding to effects and making chains.\n Categories of spell and trap cards . Like I said, the icons that define how spells and traps work are in the Standard Rules. But those little circles we live and breathe mean nothing to a new player, and they're a little tricky to get at first. Let your new player navigate the card text. When they say something like, It sounds like this one stays on the field, they're getting it, and you can point out the icon.\n The hand limit. This doesn't usually matter in the Advanced Format. It definitely doesn't matter in Speed Duels.\n What happens when two monsters with 0 ATK battle . What are all the timings when you can use stat modifiers during battle? And what are the finer details of the Damage Step? Don't bother. They'll find those birds I mentioned earlier. Your friend will never want to play Yu-Gi-Oh again. Deal with this stuff once they're hooked and into it.\n There are more things players don't need to know to get started and have a good time. Play it by ear. A good rule of thumb is that if it's not essential, you don't need to bring up proactively."
          },
          {
            "title": "Pre-Preparation of Rites",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/228045_in_800x800.jpg",
            "extra": "Speed Duel: Battle City Box, Common",
            "content": ""
          },
          {
            "title": "How To Prepare",
            "image": "https://mktg-assets.tcgplayer.com/content/opengraph/MTG-Tezzeret-EOE-CROPPED.png",
            "extra": "",
            "content": "You can get by just cracking open a starter set, breaking the decks out of the plastic wrap, and getting right into it. But since you're already here and reading this article, here are a few zero-effort things you can do to max out the chance your learner will… like, learn stuff. And not hate it.\nGet familiar with the decks. In a second I'll give you a rundown of each starter deck by deck, but it really helps to look at each card - either here on TCGplayer by clicking through on the deck lists below, or doing it the old fashioned way by thumbing through cardboard squares.\nDon't know the text of Spider Egg? Don't worry, nobody knows that, at least not under normal circumstances. But it's going to help if you know it, when your learner's trying to figure it out for themselves.\nArrange your decks the way you want them. For the first two starters that just means making sure the decks are separated - easy, since the set codes have 'A', 'B', and 'C' before the card number - and you've got the right skill card ready to go. For the two-character starters that are more recent, it means stripping the 30 cards provided down to the recommended 20-card build. Save yourself time, do this in advance.\n Make sure you have pen and paper, and if needed, token cards. You don't want your dueling protégé to feel like they don't know what's going on, just because they don't have a notepad or proper tokens.\nMore than that, remember this one thing: you're not playing to beat your opponent as hard as possible. In fact, you're not even playing to win. Other than just straight being a horrible teacher, the best way to make someone feels defeated when they learn a new game, is to defeat them at that game. Sure, yes, everyone needs to be able to lose with grace, but in this particular case that means you need to do that, as the person with all the knowledge about the game system.\n You want your learner to have a good time, to feel confident, and to want to play Yu-Gi-Oh again. If they have a bad time and believe they'll suck forever, they'll stop before they even try. Let them have those W's, at least until they get the hang of it.\n So let's talk about each of these starters."
          },
          {
            "title": "Duelists Of Tomorrow Starters",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/600123_in_600x600.jpg",
            "extra": "Duelists of Tomorrow: Kaiba's Deck",
            "content": "The Duelists of Tomorrow features three Starter Decks, for Joey, Mai, and Kaiba. It was released alongside the second 3-deck starter set, Destiny Masters, and I really like both decks for how they approach the teaching experience.\n The two early starter sets really placed an emphasis on simplicity, offering Main Deck cards that are pretty easy for a new player to understand, and giving each character three different skill cards that can raise the complexity as your learner gets the hang of everything. There aren't a lot of reactive cards in these decks, so you can keep the first few games clean and quick. Then you can ramp stuff up a bit and introduce some different game elements.\nTake a look at the Kaiba deck and you'll see what I mean."
          },
          {
            "title": "",
            "image": "",
            "extra": "",
            "content": "Continued"
          }
        ]
      },
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/yugioh/2025-01/Most%20Busted%20Commons/YGO-Most-Busted-Commons.jpg",
        "headline": "The Top 10 Biggest Sleeper Hit Commons In YG",
        "sub_headline": "YuGi's lowest rarity is the home of many completely-forgettable cards. Commons have a hard time standing aesthetically and functionally - they're just not that good most of the time. Cards that debut with a common printing can still be essential components of a top competitive strategy, but that's typically the exception. It's overwhelmingly likely that a common in a booster is probably just pack filler and hardly worth the time and effort to read. Usually.\nBut despite the odds, you really should read your commons. Yugi history is littered with commons that brushed off the shackles of their rarity and ascended to become format-defining cards. If bad Secret Rares can exist, then 'broken' commons is just an inevitability, right? You never know when that 'pack filler' card might turn out to be the next Vanity's Emptiness or Upstart Goblin. On that note, this week we're taking a look at 10 of the biggest sleeper hits in Yugi history. Every card on this list originally debuted as a common, and most first appeared in a core booster.",
        "sections": [
          {
            "title": "#10 Kabazauls",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/22116_in_800x800.jpg",
            "extra": "Kabazauls",
            "content": "A common in Dark Revelation Volume 1 and Structure Deck: Dinosaur's Rage, Kabazauls holds a surprising record of having the most ATK of any Level 4 Normal Dinosaur. That detail became incredibly relevant when Rescue Rabbit and Evolzar Laggia dropped in Photon Shockwave and introduced a powerful new Xyz strategy. Dino Rabbit's tournament successes sent duelists into a frenzy digging through old collections for copies of Kabazauls, which rose to a handful of dollars in the 2011 market. Its combination of Type, Attribute and ATK made it the perfect choice for a top competitive deck nearly six years after Dark Revelation."
          },
          {
            "title": "#9 Fossil Dig",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/497956_in_800x800.jpg",
            "extra": "Fossil Dig",
            "content": "Reinforcement of the Army, Fire Formation - Tenki and Bonfire all have one thing in common: they were all immediately useful on release. ROTA dropped alongside Exiled Force and Marauding Captain, Bonfire arrived alongside the Snake-Eyes deck and Tenki was linked to the Fire Fist deck, Fire Kings and dozens of other Beast-Warrior monsters released through the years. \n Fossil Dig, meanwhile, searched almost nothing of importance despite having a larger Level range than the preceding cards. Like Summoner's Art, the value of Fossil Dig's search effect was very limited until new targets were released. In the case of Summoner's Art, the release of Qliphort Scout put the spell on the map for the first time outside of some gimmicky Deep Draw Dragon strategies. For Fossil Dig, Souleating Oviraptor and Miscellaneousaurus were enormous upgrades to existing targets - namely Jurrac monsters."
          },
          {
            "title": "#8 Scrap Recycler",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/212657_in_800x800.jpg",
            "extra": "Scrap Recycler",
            "content": "Cards that send monsters to the graveyard have pretty clear-cut value, most of the time anyways. Scrap Recycler saw a bit of play out of the box following its launch in Structure Deck: Machina Mayhem, but it didn't really take off until around eight years later. It took nine years for Scrap Recycler to see its first reprint, and there's really only one reason why it showed up again in a reprint set so urgently: its ability to send Orcust monsters from the deck to the graveyard was suddenly very, very relevant. \n 2019 Orcust decks leaned on Scrap Recycler to compensate for the Limit on Armageddon Knight and Dark Grepher. Mathematician also saw a bit of play, but Scrap Recycler had the advantage of also being able to find Orcust Knightmare. As Orcust play waned following the ban on Orcust Harp Horror, Scrap SPYRAL became the new home of Scrap Recycler."
          },
          {
            "title": "#7 Smoke Grenade Of The Thief",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/24240_in_800x800.jpg",
            "extra": "#7 Smoke Grenade Of The Thief",
            "content": "The Duel Monsters era of Yu-Gi-Oh contains a batch of surprisingly powerful Equip Spells. Snatch Steal and Premature Burial are certainly the most memorable, but so are Autonomous Action Unit, United We Stand and Mage Power. There are even a few sleeper picks that never quite woke up, like the budget version of Snatch Steal for Archfiends: Falling Down. \n Smoke Grenade of the Thief definitely had the best turnaround though, evolving from a virtually unplayable Equip Spell into one of the few Forbidden cards of its kind. That's all thanks to the power of the Infernoble Knights theme and their unique ability to trigger Smoke Grenade's discard effect over and over again. There's nothing quite like losing most - or all - of your starting hand to a single spell effect. Thankfully, Smoke Grenade of the Thief is glued to the Forbidden list, and I have a hard time picturing it leaving anytime soon."
          },
          {
            "title": "#6 Divine Sword - Phoenix Blade",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/174423_in_800x800.jpg",
            "extra": " Divine Sword - Phoenix Blade",
            "content": "Speaking of Equip Spells, the 2005 release of Divine Sword - Phoenix Blade was completely unassuming. It offered little more than an ATK boost for your Warrior monsters and an opportunity to recycle it if you loaded your graveyard with enough Warriors. It didn't see much play until it became part of a set of crucial combos in Gouki, where filling the graveyard with Warriors was less of a challenge and more of a byproduct of existing combos. \nThe Gouki Link-spam strategy conveniently aligned with the release of Isolde, Two Tales of the Noble Knights, which unlocked the deck's ability to dump Phoenix Blade into the graveyard. Thanks to Phoenix Blade's lack of a once-per-turn restriction, it quickly became a source of limitless discard fodder - and free food for Knightmare Link Monsters. While Isolde is banned in the TCG, the OCG has kept it around on certain conditions: one of which is that Phoenix Blade, a common from 2005, remains Forbidden."
          },
          {
            "title": "#5 Super Rejuvenation",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/22464_in_800x800.jpg",
            "extra": "#5 Super Rejuvenation",
            "content": "I'm not sure how Konami intended for duelists to use Super Rejuvenation initially, but it never really lived up to that purpose. In theory, you could use it to pick up a couple of extra draws in a turn if you tribute two Dragons for a Tribute Summon. Since that wasn't useful, most duelists simply opted to play it in early Deep Draw Dragon Exodia strategies, using Cards of Consonance to discard The White Stone of Legend and Trade-In to discard the Blue-Eyes White Dragon searched with White Stone's effect.\n Dragon Rulers changed everything about how duelists saw Super Rejuvenation. Drawing a couple of cards when resolving it was pretty close to the worst case scenario. In the Dragon Ruler deck, the average outcome was closer to four or five cards, which made Super Rejuvenation the best draw effect in the game by a massive margin. By the time the Dragon Ruler format concluded, it had earned a spot on the Forbidden List. Today, Super Rejuvenation and all of the Dragon Ruler cards are back without making much of a splash in competitive play, which says a lot about the extent of power creep over the past decade."
          },
          {
            "title": "#4 Gren Maju Da Eiza",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/487145_in_800x800.jpg",
            "extra": "Gren Maju Da Eiza",
            "content": "Exceptionally popular with old school duelists in casual settings, Gren Maju Da Eiza is an incredibly interesting card to build around with a scaling ATK based on the number of your banished cards. Hitting over 4000+ ATK took some work in the Duel Monsters era, but it became significantly easier after floodgates like Dimensional Barrier and Macro Cosmos hit the TCG. \nStill, Gren Maju wasn't exactly a viable competitive strategy even as banishment became a more important mechanic in Yu-Gi-Oh. That is, until more cards started being printed with costs that banish cards face-down. A single Pot of Desires or Golden Castle of Stromberg raises Gren Maju to 4000 ATK, and combining the two together elevates it to a game-ending 8000 ATK. New cards transformed what was a fun, but not terribly competitive common monster into an OTK enabler in YCS-winning strategies."
          },
          {
            "title": "#3 Level Eater",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/34483_in_800x800.jpg",
            "extra": "Level Eater",
            "content": "While not quite a sleeper out of the gate, Level Eater was only operating at about a tenth of its final power level when it arrived in 2009.\nSynchro decks in the 5D's era used it to add an extra monster to their setups, enabling high-Level Synchro Summons that required multiple non-tuner materials. As long as you had a Level 5 or higher monster on the field, you could summon Level Eater from your graveyard as many times as you wanted. In the 5D's era, the limiting factor was the supply of tuners, but when Links arrived in 2017, Level Eater found an entirely new purpose: fueling infinite Link Summons. It didn't last long, taking just until February of 2018 for Konami to put the Level 1 bug on the Forbidden List. Like a lot of other monsters, including Grinder Golem and Dandylion, Level Eater's design just wasn't compatible with the Link mechanic and quickly needed to be set aside for the sake of game balance."
          },
          {
            "title": "#2 Vanity's Emptiness",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/38610_in_800x800.jpg",
            "extra": "Vanity's Emptiness",
            "content": "While we all love a good floodgate, Vanity's Emptiness was largely overlooked when it was released in Starstrike Blast - a set notorious for sleeper hits like Droll & Lock Bird, the Dragunity Knight Synchros and more. \nPlayers took a long time to catch on to the utility of Vanity's Emptiness, chiefly its ability to protect your setups from Special Summons while having a controllable off switch. Its blanket ban on Special Summons made it a perfect choice for decks that could build huge boards on turn one, or as a response to activated effects that summoned monsters. As time went on, those kinds of boards became increasingly common, and duelists started looking for more ways to protect their boards outside of the deterrence of Maxx C. That's when Vanity's Emptiness hit its stride as one of the game's most powerful traps. In 2015, it hit the Limited List in response to its widespread play, and by 2017 it joined other Special Summon counters like Royal Oppression on the Forbidden List."
          },
          {
            "title": "#1 Upstart Goblin",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/564203_in_800x800.jpg",
            "extra": "Upstart Goblin",
            "content": "No card better illustrates the shifting perspectives of the Yu-Gi-Oh competitive scene more than Upstart Goblin. The classic tale surrounding Upstart's popularity is that nobody realized how good the card was until about a decade after its release. The reality is less interesting: Upstart Goblin spent time Limited and Semi Limited between 2002 and 2007. People recognized it as a useful card early on, and it was appropriately restricted as a result.\n So, Upstart's early restriction means it wasn't a sleeper hit, right? Well not quite: as much as Upstart's Limit should have been a clue, duelists largely stopped playing Upstart outside of Exodia strategies. It just wasn't perceived as a card you needed to run unless thinning the deck was completely necessary, like in Exodia combo decks. Personally, I think deck mill effects from Lightsworn cards, Reasoning, Monster Gate and Card Trooper pushed players into a new school of thought where every card needed to be a great draw and a great card to mill. Upstart Goblin definitely isn't the latter, so its value plummet as other draw effects like Destiny Draw, Solar Recharge and Pot of Avarice spiked in popularity.\n Upstart Goblin saw a decent amount of play in the Edison Format era, but it really took off in 2013 as a new paradigm took hold. Duelists started to see Upstart Goblin as a way to effectively run a 37-card deck, letting them increase their odds of drawing specific combo pieces and power spells. It became such a problem that Konami finally slapped a Limit on Upstart Goblin just so duelists would start building 40-card decks again. Or 39-card decks, at least. Either way, Upstart Goblin is Unlimited as of about a year ago and it's very clear that the era of 37-card decks is over. It saw play sporadically in spell-heavy strategies like Sky Strikers, Runick and Spellbooks, but it wasn't very popular outside of those decks."
          },
          {
            "title": "",
            "image": "",
            "extra": "",
            "content": "That wraps up our list of sleeper hit commons! Obviously there are a lot of commons across the game that are worth talking about, including a handful of other cards that nearly destroyed the format when the Link mechanic entered the game, Fusion Monsters summonable with Instant Fusion, and unique targets for summon effects like Tyhone #2. There really are too many to mention here."
          }
        ]
      },
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/yugioh/2024-11/The%2010%20Cards%20Everybody%20Wants%20From%20Quarter%20Century%20Bonanza.jpg",
        "headline": "The 10 Cards Everybody Wants From Quarter Century Bonanza",
        "sub_headline": "In the ever-evolving world of YG, certain cards always seem to captivate duelists across all formats. Some cards become instant favorites due to their unique abilities, while other cards become enduring hits thanks to memorable art or anime nostalgia. What happens when you combine every card on the spectrum in one set, from I need this to compete, to, Ooh, another copy of my favorite card, and give them all rarity upgrades? ",
        "sections": [
          {
            "title": "A bonanza happens!",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/501748_in_600x600.jpg",
            "extra": "Market Price:  $138.34",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/575145_in_600x600.jpg",
            "extra": "Market Price: $131.46",
            "content": "Whether you're a competitive duelist or a casual collector, Quarter Century Bonanza has something special to offer, and that's doubly true for the cards I'll highlight today. So let's dive into the ranking to uncover why these iconic cards are still on everyone's wish list! Whether it's a storied history, a significant impact on current decks, or a blend of both, these cards hold a special place in the Yu-Gi-Oh world and continue to inspire duelists worldwide.\n The hardest part about a list like this? Condensing it to just a Top 10! With a set as big as Quarter Century Bonanza there could be dozens of cards you might see in a Top countdown, so planning and writing this article felt like lots of tiebreakers! That said I feel pretty confident in my answers, so let's get started!"
          },
          {
            "title": "#10 Dark Magician Girl",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/593848_in_600x600.jpg",
            "extra": "Dark Magician Girl",
            "content": "Dark Magician Girl starts off our list at Number 10 is, a card beloved by fans around the world…with not one, not two, but THREE different variants in Quarter Century Bonanza!\nWhile DMG's not the strongest card in terms of raw power, she's the epitome of nostalgia and charm in Yu-Gi-Oh, and that's cemented her place in Yu-Gi-Oh's fandom. This character isn't just a Duel Monsters era favorite - she appears in lots of places in the anime, the feature films, and the TCG, and she's a smash hit with collectors every time.\nDark Magician Girl isn't central to any big modern strategies, but her role in the anime as Yugi's faithful companion instantly made her a dueling icon. Beyond her sentimental value, she synergizes well with Spellcasters and Dark attribute decks, creating opportunities for powerful plays and interesting fields. Many players run her not just for her practical uses, but also for her collectible appeal.\nDark Magician Girl's more than just a common card, for both competitive players and fans of the anime and manga. She represents the heart of the game, serving as a link between Yu-Gi-Oh's sentimental past and its dynamic present. Whether you snag your copies for play or display, she's a classic that any duelist would be proud to own, and with three different versions in RA03 that all occupy luxury rarity slots, she's a huge standout in the set. There'll always be love for Dark Magician and Blue-Eyes White Dragon, but sometimes Dark Magician Girl leapfrogs those cards in collectability and value, and this set may be another example."
          },
          {
            "title": "#9 Legendary Six Samurai - Kizan",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/593106_in_600x600.jpg",
            "extra": "Legendary Six Samurai - Kizan",
            "content": "You may not have noticed, but this freakin' card's been annoyingly pricey for a very long time. Obviously it's not the most expensive on this list, but considering how many years Six Samurai decks have been out of the limelight, it's kind of remarkable that it's always cost more than 10$ for a playset.\nSamurai have attracted fans pretty consistently over the years, and Kizan remains a favorite for both new and experienced players. With dynamic mechanics and an ability to support high-stakes combos, Kizan's an enduring figure in competitive play. Owning Kizan is a must for any Six Samurai players looking to max out their deck's potential, and it feels like that won't change no matter what new cards the theme gets. Obviously the new Six Samurai monsters from Rage of the Abyss are great, but if it ever gets to a point Kizan isn't needed, we'll know the game's been lost to powercreep."
          },
          {
            "title": "#8 Crystal Beast Sapphire Pegasus",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/592924_in_600x600.jpg",
            "extra": "Crystal Beast Sapphire Pegasus",
            "content": "If you missed Crystal Beasts the first time around, and Kotton's remarkable showing at YCS Cancun, then let's recap: Crystal Beast Sapphire Pegasus lets you establish your board and prepare for stronger plays with ease. It fills up your back row with Crystal Beasts that you can summon or use as resources, and it cranks out Rank 4s so it doesn't matter if you're playing a pure build or not - this card's legit in any version of Crystal Beasts you can come up with.\nFor fans of Crystal Beasts, Sapphire Pegasus is indispensable. It offers the chance to play a highly strategic game centered around careful planning and resource management. Sapphire Pegasus is both powerful and versatile, and a Crystal Beast deck would be incomplete without it. Also, it's really pretty in these rarities, none of which existed when Sapphire Pegasus first debuted"
          },
          {
            "title": "#7 Atlantean Dragoons",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/592208_in_600x600.jpg",
            "extra": "Atlantean Dragoons",
            "content": "Dragoons works well with cards that discard from the hand or require tribute, allowing players to set up their field with critical monsters. It's particularly valuable for Mermail and Atlantean decks, and yes, you can spam it as many times as you can per turn.\n I don't miss the era of 2013 when this deck was unbeatable, but the new combos are really fun. Plus, I love that this card's now available in more high rarities! But even if you want a lower rarity, you have choices. And to clarify, I think the art's cool, not cute. Yes, I think things like bats are cute, but these guys are just creepy."
          },
          {
            "title": "#6 Sky Striker Mobilize - Linkage!",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/593156_in_600x600.jpg",
            "extra": "Sky Striker Mobilize - Linkage!",
            "content": "Halfway through the list, Sky Striker Mobilize - Linkage! is a crucial asset for modern Sky Striker decks. I never knew how much the deck needed it until the card debuted and we started to see it in action. Look no further than Ryan Yu's runner-up build from YCS Niagara and his many feature matches that weekend to see how good this thing is. \nThis card can help trigger rapid Link Summons, which are essential for maintaining the flexibility that defines Sky Striker strategies. It allows duelists to move through their deck quickly and make the most of the typical Sky Striker field. Of all the new Sky Striker support cards, it's kinda sad how many have been… awful, to say the least. Linkage is actually phenomenal if you still need convincing, and running it at two is a common choice."
          },
          {
            "title": "#5 The Dragon Rulers",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/592238_in_600x600.jpg",
            "extra": "The Dragon Rulers",
            "content": "When the Dragon Rulers were first released, they transformed the Yu-Gi-Oh landscape. Tempest, Tidal, Blaster, and Redox each represented a different category of monster, giving players access to powerful, elemental dragons that could summon themselves from the hand or graveyard by banishing other monsters of the same attribute. \nThey not only provided versatile support across various archetypes but also made the Dragon Rulers a force to be reckoned with on their own. Each Dragon Ruler had a unique effect that could activate when discarded, allowing duelists to search for related monsters or generate powerful utilities, such as extra draw potential or removal effects.\nIn their prime, Dragon Ruler decks were notorious for their consistency, speed, and overwhelming board presence. Their effects synergized well with nearly every deck type, from Dragons to diverse attributes across archetypes, leading to explosive plays that could quickly overwhelm opponents. Dragon Rulers dominated competition as a result, inspiring both admiration and frustration among players. Their impact was so profound that most of the Dragon Rulers were ultimately banned for sake of game balance.\nDespite their bans, Dragon Rulers remain iconic cards in Yu-Gi-Oh history. They are fondly remembered by long-time duelists who experienced their glory days, and they continue to serve as benchmarks for powerful, flexible card design. If they ever return to competitive play, the Dragon Rulers are certain to reignite the storm, the waterfall, the inferno, and the boulder on the battlefield once more."
          },
          {
            "title": "#4 S:P Little Knight",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/592515_in_600x600.jpg",
            "extra": "S:P Little Knight",
            "content": "Of all the cards on this list, S:P Little Knight might bring the most value and support to the widest range of strategies. It's just so gosh darn versatile, finding at least some potential role in literally every deck that plays Link Monsters. \nKnown for its unique effects and adaptability, Little Knight can help duelists pivot between offense and defense, and let's just be happy it isn't a billion dollars anymore. I appreciate cards like S:P Little Knight getting the rarity treatment here, because it gives everyone an option. It's frustrating when cards like this are behind a price wall, especially when they're generic support (and not theme-stamped ace cards, which always feel a little more fair). I understand that price may gatekeep a specific strategy, but I don't like generic cards being insanely expensive - like back in the day when Raigeki and Mirror Force were annoying as heck to get."
          },
          {
            "title": "#3 Bonfire",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/592689_in_600x600.jpg",
            "extra": "Bonfire ",
            "content": "Bonfire clocks in at Number 2 on this list, a powerful card that boosts Fire decks by quickly searching Fire monsters to your hand. \nBonfire's an essential tool for fast, aggressive plays in those sorts of strategies. Fire decks thrive on overwhelming opponents with quick, decisive action, and Bonfire supports that approach perfectly.\nSee, that's what I would say if the card was balanced. Unlike S:P Little Knight, Bonfire isn't generic: It gives a certain theme, the theme that shall not be named, a huge buff with insane consistency. I'm very annoyed about basically all the Snake-Eye adjacent strategies, and how they've bled together into nomenclature hell."
          },
          {
            "title": "#2 Sky Striker Mobilize - Engage!",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/593146_in_600x600.jpg",
            "extra": "Sky Striker Mobilize - Engage!",
            "content": "Finally, at the top of the list is a nostalgia pool card that's here partially because it's popping up again and again in modern competition. Obviously Sky Striker Mobilize - Engage! is insanely powerful and has some of the coolest art and lore ever, but this vast cornucopia of rarities is giving people a chance to nab a busted card in a deck that's actually really fun to play, in the finish of their choice.\nEngage! is essential for Sky Striker decks, where spell cards play a critical role, and any deck that wants to leverage Sky Striker cards needs it as well. The ability to generate card advantage every turn gives Sky Striker players the upper hand, especially in long duels. It's a card that's defined how duelists approach Sky Strikers, balancing offense and defense with unmatched consistency."
          },
          {
            "title": "#1 Upstart Goblin",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/564203_in_800x800.jpg",
            "extra": "Upstart Goblin",
            "content": "No card better illustrates the shifting perspectives of the Yu-Gi-Oh competitive scene more than Upstart Goblin. The classic tale surrounding Upstart's popularity is that nobody realized how good the card was until about a decade after its release. The reality is less interesting: Upstart Goblin spent time Limited and Semi Limited between 2002 and 2007. People recognized it as a useful card early on, and it was appropriately restricted as a result.\n So, Upstart's early restriction means it wasn't a sleeper hit, right? Well not quite: as much as Upstart's Limit should have been a clue, duelists largely stopped playing Upstart outside of Exodia strategies. It just wasn't perceived as a card you needed to run unless thinning the deck was completely necessary, like in Exodia combo decks. Personally, I think deck mill effects from Lightsworn cards, Reasoning, Monster Gate and Card Trooper pushed players into a new school of thought where every card needed to be a great draw and a great card to mill. Upstart Goblin definitely isn't the latter, so its value plummet as other draw effects like Destiny Draw, Solar Recharge and Pot of Avarice spiked in popularity.\n Upstart Goblin saw a decent amount of play in the Edison Format era, but it really took off in 2013 as a new paradigm took hold. Duelists started to see Upstart Goblin as a way to effectively run a 37-card deck, letting them increase their odds of drawing specific combo pieces and power spells. It became such a problem that Konami finally slapped a Limit on Upstart Goblin just so duelists would start building 40-card decks again. Or 39-card decks, at least. Either way, Upstart Goblin is Unlimited as of about a year ago and it's very clear that the era of 37-card decks is over. It saw play sporadically in spell-heavy strategies like Sky Strikers, Runick and Spellbooks, but it wasn't very popular outside of those decks."
          }
        ]
      }
    ]
  },
  {
    "uid": "3",
    "cateName": "Dragon Ball",
    "isSelect": false,
    "items": [
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/opengraph/BlueGokuDBSOG.jpg",
        "headline": "The Most Expensive DB Super: Fusion World Cards RIGHT NOW! February, 2025",
        "sub_headline": "While not everybody was a huge fan of the soft relaunch that Fusion World caused when it hit the market, it's hard to deny that the move wasn't a resounding success for Bandai. With the original Masters game continuing to support the Zenkai series and a robust online client supporting the new era, there's a double dose of Dragon Ball available for anybody looking to spirit bomb their opponent straight into next week.",
        "sections": [
          {
            "title": " #10: Energy Marker E-07 (Grand Finals 2024-2025)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/596315_in_400x400.jpg",
            "extra": "Energy Marker - E-07 ",
            "content": "One of the most recent additions to this list, Energy Marker E-07 was handed out to the top 128 participants at the 2024-2025 Championship Finals events across the world. Energy markers are one of the cleanest ways to personalize your deck and make them feel more tailored to you, so I'm not surprised to see highly coveted copies making it into the top 10.\nThis particular version prominently features Jiren and Goku, two characters who are both fan favorites across the franchise and haymakers within the game. Throw in the prestige required to earn this card and you're onto a winner."
          },
          {
            "title": "#9 Bulla: GT (Championship Pack 03 - Finalist Edition)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/618002_in_800x800.jpg",
            "extra": "Bulla: GT (Championship Pack 03 - Finalist Edition)",
            "content": "Something particularly unique to the Dragon Ball card games, Championship packs have multiple variations that heavily reward players who manage a top finish at a big tournament. In the case of Championship Pack 03, the pack offers alternative versions of the base cards with some stunning foiling and additional accents. This version of Bulla: GT comes from the premium version of this pack, only recently becoming available at the very same events that awarded Energy Marker E-07. However, unlike the former, Bulla: GT was in no way guaranteed, turning this card into a higher-ticket chase item."
          },
          {
            "title": "#8 Energy Marker (Dragon Ball Sparking! ZERO)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/586748_in_400x400.jpg",
            "extra": "Energy Marker (Dragon Ball Sparking! ZERO)",
            "content": "As much as I joke, it was kind of refreshing to see some beautiful alternative art cards included inside the premium collector's edition of Dragon Ball Sparking! Zero. I don't feel like enough companies actively tie the different parts of their IP together, but that's certainly not something you can accuse Bandai of.\nThis Energy Marker was part of a four-card set but it's far-and-away the standout of the bunch. It can be used by anyone regardless of deck and is smothered in enough gold to make Fort Knox jealous, making it the perfect fit for anyone looking to flex at their local game store."
          },
          {
            "title": "#7: SK - FB01-015 (Regional Championship 2024-2025)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/549634_in_400x400.jpg",
            "extra": "#SK - FB01-015 (Regional Championship 2024-2025)",
            "content": "This flashy version of SK from Awakened Pulse has a similar backstory to the Vegeta promo from the same event; once players managed to secure their Top 64 prizing, this promo card was waiting for them in the next round if they managed to clear the additional bar to Top 32.\nMuch like Vegeta, this promo was decommissioned after the first wave of Regional Championships. That really helps to solidify the card as one of the most important collectors' pieces in Dragon Ball Super: Fusion World history and a worthy trophy on any fireplace."
          },
          {
            "title": "#6: SK - FB04-129 (Super Alternative Art)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/593495_in_400x400.jpg",
            "extra": "SK - FB04-129 (Super Alternative Art)",
            "content": "At last, we enter the portion of the list that you can still open fresh from a booster pack today. Super Alternative Art cards are the biggest and best of what Dragon Ball Super: Fusion World has to offer, showcasing exclusive new artwork alongside accented details and an unmatched level of foiling.\nThis treatment is reserved for the big bad Secret Rare of each set, with SK (FB04-129) being the most recent of the bunch in Ultra Limit. I'm kind of glad this is the cheapest to acquire, because the detailing is incredible. Huge fan, would love to see more cards that look this darn pretty."
          },
          {
            "title": "#5 SK GT - FB03-140 (Super Alternative Art)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/562359_in_400x400.jpg",
            "extra": "SK GT - FB03-140 (Super Alternative Art)",
            "content": "SK GT beats his previous counterpart on account of a few important factors; it's a little bit older and thus harder to find, the artwork is a little bit more iconic... and the card is an auto four-of in popular leaders like Baby Vegeta (FB04-103)\nThat causes both players and collectors to be super interested in acquiring his highest rarity, especially given the card is unlikely to stop being played overnight. For many, SK GT's Super Alternative Art has been the holy grail to pull since it released in Raging Roar."
          },
          {
            "title": "#4 SK - FB01-139 (Super Alternative Art)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/539435_in_400x400.jpg",
            "extra": "SK - FB01-139 (Super Alternative Art)",
            "content": "Damn son, how many Goku do we have?!\nJokes aside, it's no shock that the face of the franchise dominates the top of the collectibles table — least of all this version from back in Awakened Pulse. SK was rightfully the first Super Alternative Art in the game and sports some of the most iconic artwork in the entire franchise...\nWho wouldn't want to own that?"
          },
          {
            "title": "#3 Vegito - FB02-139 (Super Alternative Art)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/615774_in_800x800.jpg",
            "extra": "Vegito - FB02-139 (Super Alternative Art)",
            "content": "But being the face of the game isn't necessarily enough to command a high price tag alone — oh no, sometimes you just need to be the highest possible rarity of a card that's absolutely incredible.\nVegito is a premier Secret Rare; an unquestionable must-have for any blue leader and commonly touted as a four-of in top finishes with Zamasu: Fused (FB02-036) and SK (FB03-027). Given that blue has been a commanding meta presence (arguably the best) for some time, it makes perfect sense that Vegito is one of the most expensive cards available in boosters"
          },
          {
            "title": "#2 SK - FB05-119 (Super Alternative Art)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/611092_in_400x400.jpg",
            "extra": "SK - FB05-119 (Super Alternative Art)",
            "content": "…frankly, I'm running out of Goku jokes to make.The New Adventure variant of SK recently burst onto the scene and put the entire game on notice. It's big, it's cheap to play, and it feels like a must-have for the corresponding new leader - SK (FB05-049). If the big new green deck keeps making waves, you can expect to see this card included. That's a huge selling point straight after release.While it remains to be seen if the card can maintain such a luxurious price tag, early data is looking incredibly positive; $400 a copy is no joke, but neither is a 3-cost 45000 power tank. You've been warned. Grab this one while you can!"
          },
          {
            "title": "#1 SK - FP-001 (Serial Numbered Prize Card)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/541339_in_400x400.jpg",
            "extra": "SK - FP-001 (Serial Numbered Prize Card)",
            "content": "Huh, maybe being the face of the game *is* enough.\nThere will only ever be 777 copies of SK - FP-001. They were handed out exclusively to the Top 16 at each Regional Championship level event across the world — the most prestigious tournament circuit that Dragon Ball Super: Fusion World has seen to this point. As time goes on, more serialized prize cards will enter the game to reward the results of those willing to put in the blood, sweat and tears to reach this level..."
          }
        ]
      },
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/opengraph/DBS-Goku-Starter-Upgrade.jpg",
        "headline": "Upgrading the DB Super Fusion World GK Starter Deck",
        "sub_headline": "The primary protagonist of DB, SK himself, is one of the most exciting characters to play in the new DB Super Card Game Fusion World. A fan favorite for a reason, Goku is represents the pinnacle of power in the DB universe (or is always a step away from reaching that tier!) and his starter deck replicates that feeling of ramping beyond the opposition.",
        "sections": [
          {
            "title": "SK - FS01-01",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535904_in_400x400.jpg",
            "extra": "Starter Deck 1: SK",
            "content": ""
          },
          {
            "title": "The Hero of Dragonball",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535550_in_400x400.jpg",
            "extra": "Starter Deck 1: SK",
            "content": "Goku's starter deck plays decidedly differently than the other decks. This is something that you always love to see, but Goku's selection of cards really let you feel like you are fighting alongside the heroes of Dragonball, including Goku's oldest allies."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/614155_in_600x600.jpg",
            "extra": "Market Price: $0.02",
            "content": "Vehicles are a kind of artifact that are sometimes creatures and sometimes not. The way that each one works is that they have a crew number on them, like Crew 1, and that means you have to tap any number of creatures with a total power equal to that number, and then the Vehicle will stop being just an artifact and become an artifact creature instead. You can use a crewed Vehicle to attack, block, and activate effects where applicable. Crewing a Vehicle is a special action which means this is an action that doesn't use the stack. These happen immediately, and they can't be responded to by the opponent."
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535906_in_600x600.jpg",
            "extra": "Market Price: $0.21",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535907_in_600x600.jpg",
            "extra": "Market Price: $0.49",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535916_in_600x600.jpg",
            "extra": "Market Price: $0.16",
            "content": "Each DBS Fusion World starter deck contains all you need to play and features 16 unique cards tailored around the deck's leader. When you pick up the FS01 Goku Starter Deck, you receive all of the following:\nReady-to-play 51-card Deck x1\n Energy Marker x1\nPlaysheet/Rule Manual x1\nBonus Pack x1\nPromotion Code for the Digital Version x1"
          },
          {
            "title": "Power Up Goku and Overwhelm Your Rivals",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535910_in_600x600.jpg",
            "extra": "Market Price: $1.05",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535911_in_600x600.jpg",
            "extra": "Market Price: $0.21",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535915_in_600x600.jpg",
            "extra": "Market Price: $0.19",
            "content": "A lot of goku's cards are what I would classify as goodstuff, they represent a lot of power up front and let you quickly overpower your opponent. Many of Goku's best cards further highlight this, specializing in actively weakening opposing Battle Cards. Goku Blue does it on play, Son Gohan can shrink the opposition on attack, and the classic Kamehameha buffs your own cards while dwindling the power of your foe."
          },
          {
            "title": "Weaken The Enemy",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536828_in_600x600.jpg",
            "extra": "Market Price: $0.09",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536824_in_600x600.jpg",
            "extra": "Market Price: $3.21",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536840_in_600x600.jpg",
            "extra": "Market Price: $0.51",
            "content": "The Goku starter deck can take several upgrade paths, but I personally am fond of Red's capability to reduce the power of opposing cards and want to lean into it. Krillin, Whis, and Hit can be found in Awakened Pulse packs and all fit neatly into this upgrade strategy.\nNotably, the Goku leader himself actually doesn't have a direct synergy with this shrinking strat (not really a surprise, he's more about powering himself up traditionally), but that's okay! We can turn to an alternative leader who can help you bring destruction to your foes as they wither before him."
          },
          {
            "title": "Become the God of Destruction or Save Universe 7",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536822_in_600x600.jpg",
            "extra": "Market Price: $0.13",
            "content": ""
          },
          {
            "title": "",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536821_in_600x600.jpg",
            "extra": "Market Price: $0.13",
            "content": "When it comes to upgrading the Goku Starter deck, I believe the correct play is to get your hands on Beerus as soon as possible. Being able to dictate the flow of combat is important to the starter deck, and Beerus lets us lean even harder into that. That said, the alternative version of Goku gives you a unique build around ability, helping you buff up Universe 7 cards with the power of his leadership."
          }
        ]
      },
      {
        "thumb": "https://mktg-assets.tcgplayer.com/fit-in/1100x1100/filters:quality(75)/content/opengraph/DBSFW-Best-Green.jpg",
        "headline": "The 10 Best DB Super: Fusion World Green Cards",
        "sub_headline": "Gohan and Broly are both seeing substantial play in the first round of DB Super Card Game: Fusion World's burgeoning meta. There is some argument for claiming that Yellow, and Frieza in particular, are the most powerful option at the moment, but it's hard to beat the straightforward beatdown of green decks. If you want to be the beats, these are the 10 cards you should be picking up at time of writing.",
        "sections": [
          {
            "title": "#10 SK (FB01-085)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536911_in_400x400.jpg",
            "extra": "Awakened Pulse",
            "content": "It isn't exciting, but your deck (and this list) have to start somewhere. Drawing a card for 1 while putting down a threat early is more than solid, and SK gets the ball rolling early and can help you snowball from there. It won't ever feel like the best card in your deck, but this simple roleplayer deserves to be on the list."
          },
          {
            "title": "#9 Son Gohan: Childhood (FB01-088)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536914_in_400x400.jpg",
            "extra": "Awakened Pulse",
            "content": "Speaking of straightforward roleplayers, Son Gohan: Childhood is another that gives your early plays some gas and still finds you important cards even in the late game. Gohan can easily help you dig up threats. More importantly, some of the best ways to juice your energy are stapled to saiyains, and we'll find that's more than worth digging for."
          },
          {
            "title": "#8 SK (FB01-087)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536913_in_400x400.jpg",
            "extra": "SK (FB01-087)",
            "content": "SK is one of the cards that Gohan can dig for and absolutely helps make sure you're getting all the energy you need for your late game plays. Sometimes it will feel almost unfair to make a threat that will help keep your energy fueled, but unfair is a good feeling as long as your the one doing it. The opposition may disagree, but your goal is to win after all!"
          },
          {
            "title": "#7 Android 17/Android 18 (FB01-078)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536904_in_400x400.jpg",
            "extra": "#7 Android 17/Android 18 (FB01-078)",
            "content": "One of the premier threats available to Green decks, Android 17/Android 18 get Played and just obliterate a pair of prior problems. That would almost be good enough on its own, but this pair of murderous Androids also have Double Strike, ensuring that they can punch above their weight class when you're on the offensive."
          },
          {
            "title": "#6 Gigantic Meteor (FS03-15)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535947_in_400x400.jpg",
            "extra": "Starter Deck 3: Broly",
            "content": "Early game beatdown that can become a late game finisher. Gigantic Meteor is about as straightforward as a card can get (which is entirely fitting for Broly), but sometimes you just need damage. It isn't exciting, but the game will often just come down to how much Power you can spit out, making this card truly gigantic when it matters most."
          },
          {
            "title": "#5 Moah (FS03-13)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535946_in_400x400.jpg",
            "extra": "Starter Deck 3: Broly",
            "content": "While current Green decks are not bothering with a Paragus package, some of the best cards in Green's kit are Extra cards. Finding your interaction and ways to build energy as early as turn one is a great way to set yourself up for success, so while Moah doesn't look particularly impressive you'll be surprised by just how big of an impact this little guy can have."
          },
          {
            "title": "#4 Trunks: Future (FB01-092)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536918_in_400x400.jpg",
            "extra": "Awakened Pulse",
            "content": "While Broly is a fine option for your leader, we have here one of the primary reasons to go with Gohan instead. Trunks: Future is a fine threat, but the fact that he doubles up as a way to boost your energy is the real deal. You want to get into end game energy as quick as possible, and Trunks is absolutely key to that core part of Green's strategy."
          },
          {
            "title": "#3 Broly: BR (FS03-10)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535943_in_400x400.jpg",
            "extra": "Starter Deck 3: Broly",
            "content": "Eight energy is very far from nothing, but if you can get there (which Green, not coincidentally, specializes in), Broly: BR is one of the best cards in the entire game. Drawing a card, KOing a problem, and staying Active all roll together into a nearly insurmountable problem for your opponent. The only reason it doesn't top the list is the need to get up to the cost to start with."
          },
          {
            "title": "#2 Destructive Strength (FS03)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/535948_in_400x400.jpg",
            "extra": "Starter Deck 3: Broly",
            "content": "One of the driving strengths of Green lies in its ability to generate energy ahead of the opposition. Destructive Strength ramps you, but does so with all the destructive flavor offered up by Broly. With this cards help, you'll be able to make more big threats ahead of schedule, crushing the opposition."
          },
          {
            "title": "#1 Gohan (FB01-071) (Leader)",
            "image": "https://tcgplayer-cdn.tcgplayer.com/product/536897_in_400x400.jpg",
            "extra": "Awakened Pulse",
            "content": "While it might feel almost boring, the top card has to go to the card every deck needs: its leader. Broly is good, but I still strongly believe that Gohan is still better. The pure power generated by Gohan is intense and sets you up for a finishing swing that requires less support than Broly does to actually get the win. Start here, and work your way up the list and you've got a competitive brew going."
          }
        ]
      }
    ]
  }
]
